cleanli2/stm32/src/cmd.c
#include "fs.h"
#include "cmd.h"
#include "common.h"
#include "lprintf.h"
#include "sd/stm32_eval_spi_sd.h"
#include <stdint.h>
#include <string.h>
#include <display.h>
#define uint uint32_t
#define lprint lprintf

static char cmd_buf[COM_MAX_LEN] = "";
static uint cmd_buf_p = COM_MAX_LEN;
static uint quit_cmd = 0;
extern uint32_t task_mask;
extern uint32_t logv;

uint get_howmany_para(char *s);
char * str_to_str(char *s, char**result);
/*
void con_send(char X)
{
    __io_putchar(X);
    if(X == '\n'){
        __io_putchar('\r');
    }
}
*/
uint32_t ci=0;

uint8_t cmd_caches[CMD_CACHES_SIZE][COM_MAX_LEN] = {0};
uint32_t cmdcache_index=0;
uint32_t review_cmd_his_index;
uint8_t read_buf[512];

extern const uint8_t ziku12[];
extern const uint8_t ziku[];
uint32_t get_ziku12_size();
uint32_t get_ziku_size();
void save_sd_log()
{
    lprintf("save log to sd card:stmlog.txt\n");
    lprintf_time("save_sd_log:log start:0x%x end:0x%x size:0x%x\n",
            SPI_FLASH_LOG_START, SPI_FLASH_LOG_END, SPI_FLASH_LOG_SIZE);
    u32 ch_cnt = 0, i512_ct=0, show_ct=0;
    u32 addr = SPI_FLASH_LOG_START;
    if(FS_OK!=open_file_for_write("STMLOG", "TXT")){
        lprintf_time("open file fail:stmlog.txt\n");
        return;
    }
    memset(read_buf, ' ', 512);
    lprintf("run task log\n");
    task_log(NULL);
    dt_us_last();
    while(1){
        SPI_Flash_Read(read_buf,addr,512);
        for(i512_ct=0;i512_ct<512;i512_ct++){
            if(0xff==read_buf[i512_ct]){
                read_buf[i512_ct]='`';
            }
            else if('\r'==read_buf[i512_ct]||
                    '\n'==read_buf[i512_ct]){
            }
            else if(0x20>read_buf[i512_ct]){
                read_buf[i512_ct]='?';
            }
        }
        ch_cnt+=512;
        show_ct+=512;
        if(show_ct>(SPI_FLASH_LOG_SIZE/10)){
            lprintf("%d%%doing\n", ch_cnt*100/SPI_FLASH_LOG_SIZE);
            show_ct=0;
            toggle_led(LED_CAM_SAVING);
        }
        if(ch_cnt >= SPI_FLASH_LOG_SIZE){
            write_sec_to_file((const char*)read_buf);
            close_file();
            u32 tmus=dt_us_last();
            lprintf_time("save log OK:%dk %dus %dk/s\n",
                    SPI_FLASH_LOG_SIZE/1000,
                    tmus,
                    SPI_FLASH_LOG_SIZE*1000/tmus);
            return;
        }
        write_sec_to_file((const char*)read_buf);
        addr+=512;
    }
}
void w25f(char *p)
{
    uint32_t para1 = 0, para2=0, para3 = 0, tmp, cmdindex;
#ifdef WRITE_W25F
    const uint8_t*datawritebuf=ziku;
    uint32_t datalen = get_ziku_size();
#endif

    lprintf("p=%s\n", p);
    tmp = get_howmany_para(p);
    lprintf("tmp=%d\n", tmp);
    if(tmp>=1){
	    p = str_to_hex(p, &cmdindex);
    }
    if(tmp == 0 || cmdindex == 0){
        SD_LowLevel_Init();
        lprintf("w25 flash ID:%x\n", SPI_Flash_ReadID());
    }
    else if(cmdindex == 1){
        if(tmp>1){
            p = str_to_hex(p, &para1);
        }
        SPI_Flash_Read((uint8_t*)&para3, para1, 4);
        lprintf("w25 read 4 bytes = %X @%x\n", para3, para1);
    }
    else if(cmdindex == 2){//
        lprintf("w25f 2 addr data\n");
        if(tmp<3){
            goto err;
        }
        p = str_to_hex(p, &para1);//addr
        p = str_to_hex(p, &para2);//data
        SPI_Flash_Write((uint8_t*)&para2, para1, 4);
        lprintf("w25 write 4 bytes = %X @%x\n", para2, para1);
    }
    else if(cmdindex == 3){//
        if(tmp>1){
            p = str_to_hex(p, &para1);
        }
        para2 = 1;
        if(tmp>2){
            p = str_to_hex(p, &para2);
        }
        while(para2--){
            SPI_Flash_Read((uint8_t*)read_buf, para1, 512);
            mem_print((const char*)read_buf, para1, 512);
            para1+=512;
            lprintf("\n");
        }
    }
    else if(cmdindex == 4){//
        lprintf("erase all chip.\n");
        if(tmp<2){
            goto err;
        }
        p = str_to_hex(p, &para1);
        if(para1 != 0xe4a5ea11){
            lprintf("erase fail!");
        }
        else{
            SPI_Flash_Erase_Chip();
        }
    }
    else if(cmdindex == 5){//fake w w25f
#ifdef WRITE_W25F
        if(tmp>1){
            p = str_to_hex(p, &para1);
            lprintf("para1=%x, wbuf=0x%x, datalen=%d 0x%x\n", para1,
                    datawritebuf, datalen, datalen);
            //SPI_Flash_Write((uint8_t*)para1, datawritebuf, datalen);
        }
        else{
            lprintf("error para:w25f 5 70000//write to 0x70000");
        }
#endif
    }
    else if(cmdindex == 6){//cmd
        p = str_to_hex(p, &para1);
        p = str_to_hex(p, &para2);
        p = str_to_hex(p, &para3);
    }
    else if(cmdindex == 7){//w w25f
#ifdef WRITE_W25F
        if(tmp>2){
            p = str_to_hex(p, &para1);
            p = str_to_hex(p, &para2);
            lprintf("para1=%x, wbuf=0x%x, para2=%d\n", para1,
                    datawritebuf, datalen);
            SPI_Flash_Write(datawritebuf, para1, para2);
        }
        else{
            lprintf("error para:w25f 5 70000 18000//write to 0x70000, len 0x18000");
        }
#endif
    }
    else if(cmdindex == 8){//
        lprintf("erase one sector.\n");
        if(tmp<2){
            goto err;
        }
        p = str_to_hex(p, &para1);
        p = str_to_hex(p, &para2);
        if(para2 != 0xe4a5e07e){
            lprintf("erase %X fail", para1);
        }
        else{
            SPI_Flash_Erase_Sector(GET_SECTOR_ADDR(para1));
        }
    }
    else if(cmdindex == 0x9){//
        lprintf("switch env area\n");
        switch_env_area();
    }
    else if(cmdindex == 0xa){//
        lprintf("switch env area with data\n");
        p = str_to_hex(p, &para1);
        if(para1 != 0x5e14c6e7){
            lprintf("switch env fail", para1);
            goto err;
        }
        switch_env_area_with_data();
    }
    else if(cmdindex == 0xb){//
        lprintf("erase cur env area\n");
        p = str_to_hex(p, &para1);
        if(para1 != 0xe4a5ee7c){
            lprintf("erase env fail", para1);
        }
        else{
            erase_env_area();
        }
    }
    else if(cmdindex == 0xc){//
        lprintf("print log in spi flash:\n");
        spi_flash_log_print();
    }
    else if(cmdindex == 0xd){//
        lprintf("run task log\n");
        task_log(NULL);
    }
    else if(cmdindex == 0xe){//
        save_sd_log();
    }
    con_send('\n');

    return;
err:
    lprintf("ERROR para\n");
}

//u8 SD_Initialize(void);
#if 1
void sd(char *p)
{
    uint32_t para1 = 0, para2=0, para3 = 0, tmp, cmdindex;
    SD_Error Status = SD_OK;
    SD_CardInfo mycard;

    lprintf("p=%s\n", p);
    //strcpy(cmd_caches[ci++], p);
    if(ci > 40)
	    ci = 0;
    tmp = get_howmany_para(p);
    lprintf("tmp=%d\n", tmp);
    if(tmp>=1)
	    p = str_to_hex(p, &cmdindex);
    lprintf("cmdind=%d\n", cmdindex);
    if(tmp == 0 || cmdindex == 0){
	    lprintf("sd_init\n");
	    if((Status = SD_Init()) != SD_OK)
	    {
		    lprintf("Fail\n");
	    }
	    else{
		    lprintf("OK\n");
		    if((Status = SD_GetCardInfo(&mycard)) != SD_OK)
		    {
			    lprintf("get card info Fail\n");
		    }
		    else{
			    lprintf("block size %d\n", mycard.CardBlockSize);
			    lprintf("block capacity %d\n", mycard.CardCapacity);
		    }
	    }

