cleanli2/stm32/src/cmd.c
	    //lprintf("sd_deinit\n");
	    //SD_DeInit();
    }
    else if(cmdindex == 1){//cs high/low
	lprintf("line %d\n", __LINE__);
        str_to_hex(p, &para1);
	if(para1)
		SD_CS_HIGH();
	else
		SD_CS_LOW();
    }
    else if(cmdindex == 2){//
	lprintf("line %d\n", __LINE__);
	SD_WriteByte(SD_DUMMY_BYTE);
    }
    else if(cmdindex == 3){//
        str_to_hex(p, &para1);
	lprintf("line %d para1 %x\n", __LINE__, para1);
	lprintf("read byte %x\n", SD_SPI_ReadWriteByte(para1));
    }
    else if(cmdindex == 4){//
	lprintf("SD_GetRes %x\n", SD_GetRes());
    }
    else if(cmdindex == 5){//cmd
	lprintf("line %d %x %x %x\n", __LINE__, para1, para2, para3);
        p = str_to_hex(p, &para1);
        p = str_to_hex(p, &para2);
        p = str_to_hex(p, &para3);
	SD_SendCmd(para1, para2, para3);
    }
    else if(cmdindex == 6){//cmd
    }
    else if(cmdindex == 7){//low init/deinit
        str_to_hex(p, &para1);
	lprintf("line %d para1 %x\n", __LINE__, para1);
	if(para1)
		SD_LowLevel_Init(); 
	else
		SD_LowLevel_DeInit();
    }
    else if(cmdindex == 8){//
	lprintf("do basic Init()\n");
	lprintf("SD_LowLevel_Init()\n");
	/*!< Initialize SD_SPI */
	SD_LowLevel_Init(); 

	/*!< SD chip select high */
	lprintf("SD_CS_HIGH()\n");
	SD_CS_HIGH();

	lprintf("send SD dummy bytes\n");
	/*!< Send dummy byte 0xFF, 10 times with CS high */
	/*!< Rise CS and MOSI for 80 clocks cycles */
	for (int i = 0; i <= 9; i++)
	{
		/*!< Send dummy byte 0xFF */
		SD_WriteByte(SD_DUMMY_BYTE);
	}
    }
    else if(cmdindex == 9){//
        str_to_hex(p, &para1);
	lprintf("line %d para1 %x\n", __LINE__, para1);
	lprintf("read byte %x\n", SD_ReadByte());
    }
    else if(cmdindex == 0xa){//
        lprintf("read sd block:sd a addr repeat\n");
        para1=0;
        para2=1;
        if(tmp>1){
            p = str_to_hex(p, &para1);
        }
        if(tmp>2){
            p = str_to_hex(p, &para2);
        }
        lprintf("addr %x\n", para1);
        lprintf("repeat %x\n", para2);
        while(para2--){
            SD_ReadBlock(read_buf, para1, 512);
            mem_print((const char*)read_buf, para1*512, 512);
            para1 += 1;
        }
    }
    else if(cmdindex == 0xb){//
        sf_read_id();
    }
    else if(cmdindex == 0xc){//
        str_to_hex(p, &para1);
        lprintf("spi choose %x\n", para1);
        spi_choose_stm32(para1);
    }
    else if(cmdindex == 0xd){//
        str_to_hex(p, &para1);
        lprintf("spi speed %x\n", para1);
        spi_speed(para1);
    }
    else if(cmdindex == 0xe){//
        lprintf("write sd block:sd e filldata blockaddr repeat\n");
        para1=0x55;
        para2=0x0;
        para3=1;
        if(tmp>1){
            p = str_to_hex(p, &para1);
        }
        if(tmp>2){
            p = str_to_hex(p, &para2);
        }
        if(tmp>3){
            p = str_to_hex(p, &para3);
        }
        lprintf("fill %x\n", para1);
        lprintf("blockaddr %x\n", para2);
        lprintf("dataaddr %W\n", ((uint64_t)para2)<<9);
        memset(read_buf, para1, 512);
        while(para3--){
            lprintf("write @%Wsd block ret:%x\n", ((uint64_t)para2)<<9,
                    SD_WriteBlock(read_buf, ((uint64_t)para2), 512));
            para2++;
        }
    }
    else if(cmdindex == 0xf){//
        //SD_Initialize();
    }
    con_send('\n');

    return;

//error:
//    lprint("Err!\ndispcchar [x] [y]\n");
}
#if 0
void sd_cmds(char *p)
{
    uint tmp = get_howmany_para(p);
    uint para; 
    lprintf("tmp %x\n", tmp);
    if(tmp==0){
	    for(uint i =0;i<40;i++){
		    if(strlen(cmd_caches[i])>0){
			    lprintf("%d:%s\n", i, cmd_caches[i]);
		    }
	    }
    }
    else{
	    p = str_to_hex(p, &para);
	    lprintf("para %x\n", para);
	    switch(para){
		    case 0:
			    lprintf("clear cmd caches\n");
			    memset(*cmd_caches, 0, 1600);
			    ci = 0;
			    break;
		    case 1:
			    memset(cmd_caches[ci], 0, 40);
			    ci--;
			    break;
		    case 2:
			    for(uint i =0;i<40;i++){
				    if(strlen(cmd_caches[i])>0){
					    lprintf("%d:%s\n", cmd_caches[i]);
					    sd(cmd_caches[i]);
				    }
			    }
			    break;
		    default:
			    lprintf("do nothhing\n");
	    }
    }
    con_send('\n');

    return;
}
#endif
#endif


#if 0
void lcd19264init(char *p)
{
  lcd_init();
  Display_Chinese2_12(0,0,ziku12+(0x18*2));//page 0, column 0
  Display_Chinese2_12(0,20,ziku12+(0x18*3));//page 0, column 20
  Display_Chinese_r90(0,40,lei1);//page 0, column 20
  /*
  Display_Chinese2(0,40,ziku);
  Display_Chinese2(0,60,ziku+0x20);
  Display_Chinese2(0,80,ziku+0x40);
  Display_Chinese2(0,100,ziku+0x60);
  Display_Chinese2(0,120,ziku+0x180);
  Display_Chinese2(0,140,ziku+0x1a0);
  Display_Chinese2(0,160,ziku+0x1b0);
  */
  for (int ti = 0;ti < 3;ti++){
      for(int tj = 0;tj < 12;tj++){
          Display_Chinese2((ti+1)*2,tj*16,ziku+(0x20*(ti*12+tj)));
      }
  }
    con_send('\n');

    return;

error:
    lprint("Err!\ndispcchar [x] [y]\n");
}
#endif

void buzztest(char *p)
{
    uint para = 1, tmp;

    tmp = get_howmany_para(p);
    if(tmp>=1){
	    p = str_to_hex(p, &para);
    }
    lprintf("para %x %d\n", para, para);
    RCC_APB2PeriphClockCmd(BEEP_GPIO_PERIPH, ENABLE);

    GPIO_InitTypeDef GPIO_InitStructure;
    GPIO_InitStructure.GPIO_Pin = BEEP_GPIO_PIN;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
    GPIO_Init(BEEP_GPIO_GROUP, &GPIO_InitStructure);
    GPIO_ResetBits(BEEP_GPIO_GROUP, BEEP_GPIO_PIN);
  //led end

    while(!con_is_recved()){
	    /* Set*/
        if(para > 200){
            lprintf("Set PB5\n");
        }
	    GPIO_ResetBits(BEEP_GPIO_GROUP, BEEP_GPIO_PIN);
	    delay_ms(para);
	    /* ReSet */
        if(para > 200){
            lprintf("Reset PB5\n");
        }
	    GPIO_SetBits(BEEP_GPIO_GROUP, BEEP_GPIO_PIN);
	    delay_ms(para);
    }
    con_send('\n');

    return;

//error:
//    lprint("Err!\ndispcchar [x] [y]\n");
}
void ledtest(char *p)
{
    uint para = 0, tmp;

