cleanli2/stm32/src/cmd.c
    tmp = get_howmany_para(p);
    if( tmp >= 1){
	    p = str_to_hex(p, &para);
    }
    toggle_led(para);
    con_send('\n');

    return;

//error:
//    lprint("Err!\ndispcchar [x] [y]\n");
}
#if 0
void dispcchar(char *p)
{
    uint x = 0, y=0, offset = 0, tmp;

    tmp = get_howmany_para(p);
    if( tmp < 2)
        goto error;
    p = str_to_hex(p, &x);
    p = str_to_hex(p, &y);
    if(tmp > 2)
        str_to_hex(p, &offset);
    lprintf("x=%d y=%d\n", x, y);
    if(tmp == 2)
        Display_Chinese(x,y,jiong1);
    else
        Display_Chinese2(x,y,ziku+offset);
    con_send('\n');

    return;

error:
    lprint("Err!\ndispcchar [x] [y]\n");
}

void dispwb(char *p)
{
    uint page = 0, cl=0, data = 0, tmp;

    tmp = get_howmany_para(p);
    if( tmp < 3)
        goto error;
    p = str_to_hex(p, &page);
    p = str_to_hex(p, &cl);
    str_to_hex(p, &data);
    page = page%4;
    cl = cl % 192;
    data &= 0xff;
    lprintf("page=%x cl=%x d=%x\n", page, cl, data);
    lcd_write_byte(page, cl, data);
    con_send('\n');

    return;

error:
    lprint("Err!\ndwb [page] [col] [data]\n");
}
void Display_Chinese2_fullscreen(uint32_t x, uint32_t y, uint32_t zi_offset)
{
    for(int i = 0; i <48; i++)
    {
        Display_Chinese2(x, y, ziku + 0x20*zi_offset++);
        y += 16;
        if(y>191){
            y = 0;
            x+=2;
        }
    }
}

void show_ziku(char *p)
{
    uint stt_off = 0, stp_off =0, tmp, zikusize;
    uint zi, x=0, y=0;

    zikusize = get_ziku_size();
    stp_off = zikusize;
    lprintf("size of ziku:%x %d\n", stp_off, stp_off);
    tmp = get_howmany_para(p);
    if( tmp > 0)
        p = str_to_hex(p, &stt_off);
    if( tmp > 1)
        p = str_to_hex(p, &stp_off);
    if(stp_off > zikusize)
        stp_off = zikusize;
    zi = stt_off;
    while(zi<stp_off){
        lprintf("zi %d stop %d\n", zi, stp_off);
        Display_Chinese2_fullscreen(x,y,zi);
        delay_ms(1000);
        zi+=12;
        if(con_is_recved())
            break;
    }
    con_send('\n');

    return;
}
#endif
void poweroff(char *p)
{
    char*p1;
    uint32_t np = get_howmany_para(p);
    lprintf("number of para=%d\n", np);
    if(np==0){
        lprintf("Power OFF!\n");
        power_off();
    }
    else{
        p = str_to_str(p, &p1);
        lprintf("p1=%s\n", p1);
    }
    if(!strcmp(p1, "sleep")){
        lprintf("goto sleep\r\n");
        __WFI();
        lprintf("wake from sleep\r\n");
    }
    else if(!strcmp(p1, "stop")){
        lprintf("goto stop\r\n");
        PWR_EnterSTOPMode(PWR_Regulator_LowPower,PWR_STOPEntry_WFI);
        lprintf("wake from stop\r\n");
    }
    else if(!strcmp(p1, "standby")){
        PWR_WakeUpPinCmd (ENABLE);
        PWR_EnterSTANDBYMode();
    }
    else{
        lprintf("error para.\r\n");
    }
    con_send('\n');

    return;

}
void adc(char *p)
{
    (void)p;
    con_send('\n');
    adc_test();

    return;

}
void cmd_exit(char *p)
{
    (void)p;
    lprintf("Quit CMD!\n");
    quit_cmd = 1;

    return;

}
void rebootd(char *p)
{
    (void)p;

    reboot_download();

    return;

}
void reboot(char *p)
{
    (void)p;
    soft_reset_system();

    return;

}
#define BLOCK_SIZE 0x400
void fmerase(char *p)
{
    uint32_t er_ct = 1, addr;
    //uint32_t len = 0xffff, data = 0;
    //uint32_t dp = (uint32_t*)0x08010000;
    FLASH_Status fret;

    lprintf("\n");
    uint32_t tmp = get_howmany_para(p);
    if(tmp==0)goto err;
    if(tmp>=1){
        p = str_to_hex(p, &addr);
    }
    if(tmp>=2){
        p = str_to_hex(p, &er_ct);
    }
    FLASH_Unlock();
    while(er_ct--){
        if(FLASH_COMPLETE == (fret=FLASH_ErasePage(addr))){
            lprintf("flash oper done @%X\n", addr);
        }
        else{
            lprintf("flash oper err:%d @addr %X\n", fret, addr);
        }
        addr+=BLOCK_SIZE;
    }
    FLASH_Lock();
#if 0
    while(len){
        if(*dp++ != data){
            ne_ct++;
            lprintf("\rNE:%d", ne_ct);
        }
        len -= 4;
    }
#endif

    return;
err:
    lprintf("err:fmerase addr count\n");
    return;

}
void fmwtest(char *p)
{
    uint32_t len = 1, data = 0, addr;
    //uint32_t ne_ct = 0;
    //uint32_t dp = (uint32_t*)0x08010000;
    FLASH_Status fret;

    lprintf("\n");
    uint32_t tmp = get_howmany_para(p);
    if(tmp>=2){
        p = str_to_hex(p, &data);
        p = str_to_hex(p, &addr);
        if(tmp>=3) p = str_to_hex(p, &len);
        FLASH_Unlock();
        while(len){
            if(FLASH_COMPLETE == (fret=FLASH_ProgramWord(addr, data))){
                //lprintf("flash oper done\n");
            }
            else{
                lprintf("flash oper err:%d adr %X\n", fret, addr);
            }
            addr+=4;
            len-=4;
        }
        FLASH_Lock();
    }
    else{
        lprintf("err:fmwtest data addr (len)\n");
    }
#if 0
    while(len){
        if(*dp++ != data){
            ne_ct++;
            lprintf("\rNE:%d", ne_ct);
        }
        len -= 4;
    }
#endif

    return;

}
void fmrtest(char *p)
{
    uint32_t len = 0xffff, ne_ct = 0, data = 0, addr;
    uint32_t* dp = (uint32_t*)0x08010000;

    lprintf("\n");
    uint32_t tmp = get_howmany_para(p);
    if(tmp<3){
        goto err;
    }
    else{
        p = str_to_hex(p, &data);
        p = str_to_hex(p, &addr);
        p = str_to_hex(p, &len);
        dp = (uint32_t*)addr;
        while(len){
            if(*dp++ != data){
                ne_ct++;
                lprintf("\rNE:%X addr %X", ne_ct, (uint32_t)(dp-1));
            }
            len -= 4;
        }
    }
    lprintf("\n\n");
    return;

err:
    lprintf("fmrtest data addr len\n");
    return;

}
void usb_strg_init(char *p)
{
    uint32_t n, p1 = 0;
    n = get_howmany_para(p);
    if(n>0){
        p = str_to_hex(p, &p1);
        lprintf("p1=%d\n", p1);
    }
    usb_main_init(p1);
}
void logflag(char *p)
{
    uint32_t n, p1 = 0;
    n = get_howmany_para(p);
    if(n>0){
        p = str_to_hex(p, &p1);
        lprintf("logf set to %x\n", p1);
    }
    logv = p1;
}
void test(char *p)
{
    u32 p1,p2;
    p = str_to_hex(p, &p1);
    p = str_to_hex(p, &p2);
    //os_lock_test();
    //put_sound(p1, p2);
#if 0
    uint32_t px1, py1, s,e;
    static int txc=0;
    p = str_to_hex(p, &px1);
    p = str_to_hex(p, &py1);
    p = str_to_hex(p, &s);
    p = str_to_hex(p, &e);
    lprintf("para:%x %x %x %x\n", px1,py1,s,e);

