cleanli2/stm32/src/cmd.c
    LCD_Clear(WHITE);
    if(txc++&0x1){
        lprintf("old\n");
        LCD_DrawLine(240, 400, px1, py1);
    }
    else{
        lprintf("new\n");
        LCD_DrawLine_direction(240, 400, px1, py1, s, e);
    }
#endif
#if 0
    uint32_t n, p1, p2;
    uint64_t t1, t2, t3,t4,t5,t6,t7;
    t1= get_system_us();
    n = get_howmany_para(p);
    t2= get_system_us();
    p = str_to_hex(p, &p1);
    beep_by_timer(p1);
    return;
    t3= get_system_us();
    if(n==1){
    t4= get_system_us();
        delay_us(p1);
    t5= get_system_us();
    }
    else{
    t4= get_system_us();
        delay_ms(p1);
    t5= get_system_us();
    }
    t6= get_system_us();
    t7= get_system_us();
    lprintf("1:%U\n", t1);
    lprintf("2:%U\n", t2);
    lprintf("3:%U\n", t3);
    lprintf("4:%U\n", t4);
    lprintf("5:%U\n", t5);
    lprintf("6:%U\n", t6);
    lprintf("7:%U\n", t7);
#endif
    return;

}
void tm(char *p)
{
    return;

}

void history(char *p)
{
    (void)p;
    uint32_t n = CMD_CACHES_SIZE, cix = cmdcache_index;
    con_send('\n');
    while(n--){
        if(cix==0){
            cix = CMD_CACHES_SIZE-1;
        }
        else{
            cix--;
        }
        if(cmd_caches[cix][0]!=0){
            lprintf("%s\n", cmd_caches[cix]);
        }
    }
    con_send('\n');

    return;
}

void i2ccmd(char *p)
{
    (void)p;
    char *p1;
    uint32_t np, p2=0x00;
    np = get_howmany_para(p);
    lprintf("number of para=%d\n", np);
    if(np>=1){
        p = str_to_str(p, &p1);
        lprintf("p1=%s\n", p1);
    }
    if(np>=2){
        p = str_to_hex(p, &p2);
        lprintf("p2=%d\n", p2);
    }
    if(!strcmp(p1, "w")){
        pcf8574t_writeData(p2);
    }
    if(!strcmp(p1, "r")){
        pcf8574t_readData1((uint8_t*)&p2);
        lprintf("p2=%x\n", p2);
    }
    con_send('\n');

    return;

}
void keytest(char *p)
{
    (void)p;
    uint8_t rchar;
    con_send('\n');
    while((rchar=con_recv())!=ENTER_CHAR){
        lprintf("%b\n", rchar);
    }
    con_send('\n');

    return;

}
void envprint(char *p)
{
    int tmp = get_howmany_para(p);
    lprintf("number of para %d\n", tmp);
    if(tmp>0){
        lprintf("raw env:\n");
        printrawenv();
    }
    else{
        printenv();
    }
    con_send('\n');

    return;

}
void envget(char *p)
{
    uint32_t tmp;
    char* name, value[ENV_MAX_VALUE_LEN];
    tmp = get_howmany_para(p);
    lprintf("tmp=%d\n", tmp);
    if(tmp<1){
        lprintf("err\n");
        return;
    }
    str_to_str(p, &name);
    if(ENV_FAIL == get_env(name, value)){
        lprintf("get_env fail\n");
        return;
    }
    else{
        lprintf("get_env OK\n");
    }
    lprintf("%s=%s\n", name, value);
    con_send('\n');

    return;

}
void envset(char *p)
{
    uint32_t tmp;
    char* name, *value=0;
    tmp = get_howmany_para(p);
    lprintf("tmp=%d\n", tmp);
    if(tmp<1){
        lprintf("err\n");
        return;
    }
    if(tmp>=1){
        p = str_to_str(p, &name);
    }
    if(tmp>=2){
        p = str_to_str(p, &value);
    }
    if(value){
        lprintf("todo: %s=%s\n", name, value);
    }
    else{
        lprintf("todo: del %s\n", name);
    }
    if(ENV_FAIL == set_env(name, value)){
        lprintf("set_env fail\n");
        return;
    }
    else{
        lprintf("set_env OK\n");
    }
    con_send('\n');

    return;

}
void rtcs(char *p)
{
    (void)p;
    con_send('\n');
    if(RTC_OK==adjust_1min(0)){
        lprintf("slower 1 min OK\n");
    }
    else{
        lprintf("slower 1 min FAIL\n");
    }
    return;
}
void rtcf(char *p)
{
    (void)p;
    con_send('\n');
    if(RTC_OK==adjust_1min(1)){
        lprintf("faster 1 min OK\n");
    }
    else{
        lprintf("faster 1 min FAIL\n");
    }
    return;
}
void ps(char *p)
{
    (void)p;
    lprintf("ps start:\n");
  if(os_is_running){
    while(!con_is_recved()){
        lprintf("===============\n");
        showtasks();
        os_10ms_delay(1000);
    }
  }
  else{
    showtasks();
  }
    return;
}
void m_p(char *p)
{
    (void)p;
    uint32_t tmp, i=0;
    tmp = get_howmany_para(p);
    if(tmp>0){
        p = str_to_hex(p, &i);
    }
    play_music(music_lst[i], 0);
    return;
}
struct point stress_pts[] = {
    {225, 305}
};
void stress(char *p)
{
    (void)p;
    u32 para_n, test_time, intv;
    para_n = get_howmany_para(p);
    if(para_n<=1){
        lprintf("please input test time minutes & touch interval\nstress min interval\n");
        return;
    }
    p = str_to_hex(p, &test_time);
    p = str_to_hex(p, &intv);
    gftp->pts = NULL;//disable currentt test
    gftp->n_pt = 1;
    gftp->cur_n_pt = 0;
    gftp->interval = intv;
    gftp->cur_interval = 0;
    gftp->last= test_time;
    gftp->start= g_ms_count;
    lprintf("##########stress test start %s\n", get_rtc_time(0));
    lprintf("##########stress touch interval 20*%d ms\n", gftp->interval);
    lprintf("##########stress test time long %d mins\n", gftp->last);
    gftp->pts = stress_pts;
    return;
}

void rtc_cmd(char *p)
{
    uint8_t d[6], tmp;

    tmp = get_howmany_para(p);
    lprintf("tmp=%d\n", tmp);
    if(tmp==6){
        p = str_to_hex(p, (uint*)&d[0]);
        p = str_to_hex(p, (uint*)&d[1]);
        p = str_to_hex(p, (uint*)&d[2]);
        p = str_to_hex(p, (uint*)&d[3]);
        p = str_to_hex(p, (uint*)&d[4]);
        p = str_to_hex(p, (uint*)&d[5]);
        rtc_write(d);
        set_env("LastTimeAdj", get_rtc_time(NULL));
    }
    else if(tmp==0){
        lprintf("%s\n", get_rtc_time(0));
    }
    else if(tmp==1){
        p = str_to_hex(p, (uint*)&d[0]);
        lprintf("read reg %b=%b\n", d[0], rtc_read_reg(d[0]));
    }
    else if(tmp==2){
        p = str_to_hex(p, (uint*)&d[0]);
        p = str_to_hex(p, (uint*)&d[1]);
        lprintf("write reg %b->%b\n", d[0], d[1]);
        rtc_write_reg(d[0], d[1]);
    }
    else{
        lprintf("error \n");
    }
    con_send('\n');

    return;

}
void file_op(char *p)
{
    uint32_t tmp;
    char* path;
    tmp = get_howmany_para(p);
    lprintf("tmp=%d\n", tmp);
    if(tmp<1){
        lprintf("err\n");
        return;
    }
    if(tmp>=1){
        p = str_to_str(p, &path);
        if(FS_OK==open_file_w(path)){
            lprintf("Open %s OK\n", path);
        }
        else{
            lprintf("Open %s fail\n", path);
        }
        close_file();
    }
    con_send('\n');

    return;
}
static const struct command cmd_list[]=
{
    //{"dwb",dispwb},
    {"adc",adc},
    {"bz",buzztest},
    {"exit",cmd_exit},
    {"envset",envset},
    {"envget",envget},
    {"envprint",envprint},
    {"file",file_op},
#ifndef WRITE_W25F
    {"fmerase",fmerase},
    {"fmrtest",fmrtest},
    {"fmwtest",fmwtest},
    {"go",go},
#endif
    {"help",print_help},
    {"history",history},
#ifndef WRITE_W25F
    //{"lcd19264init",lcd19264init},
    //{"lcd19264dc",dispcchar},
    {"pcf8574t", i2ccmd},
    {"kt",keytest},
    {"led",ledtest},
    {"logf",logflag},
    {"music",m_p},
#endif
    {"pm",print_mem},
    {"poff",poweroff},
    {"ps",ps},
    {"r",read_mem},
    {"reboot",reboot},
    {"rebootd",rebootd},
    {"rtc",rtc_cmd},
    {"rtcf",rtcf},
    {"rtcs",rtcs},
    {"sd",sd},
    {"stress",stress},
#ifndef WRITE_W25F
    //{"sdcmds",sd_cmds},
    {"test",test},
    {"taskmask",tm},
    //{"szk",show_ziku},
    //{"usb",usb_strg_init},
#endif
    {"w",write_mem},
    {"w25f",w25f},
    {NULL, NULL},
};
static uint32_t * mrw_addr;
void go(char *para)
{
    (void)para;
	(*((void (*)())mrw_addr))();
}

void print_help(char *para)
{
    (void)para;
    uint i = 0;
    lprintf("Version %s%s\n", VERSION, GIT_SHA1);
    lprint("Cmd:\n");
    while(1){
            if(cmd_list[i].cmd_name == NULL)
                    break;
	    lprint("--%s\n", cmd_list[i].cmd_name);
            i++;
    }
}

uint asc_to_hex(char c)
{
	if(c >= '0' && c <= '9')
		return c - '0';	
	if(c >= 'A' && c <= 'F')
		return c - 'A' + 10;
	if(c >= 'a' && c <= 'f')
		return c - 'a' + 10;
	return 0;
}

